tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
bool formatFullDateTime(uint32_t epoch, char* output, std::size_t outputSize) {
    return Esp32BaseTime::formatEpoch(epoch, output, outputSize,
                                      "%Y年%m月%d日 %H:%M");
}

bool formatInputDateTime(uint32_t epoch, char* output, std::size_t outputSize) {
    return Esp32BaseTime::formatEpoch(epoch, output, outputSize, "%Y-%m-%dT%H:%M");
}

bool formatFriendlyDateTime(uint32_t epoch,
                            uint32_t nowEpoch,
                            char* output,
                            std::size_t outputSize) {
    static constexpr uint32_t kUtcOffsetSec = 8UL * 3600UL;
    static constexpr uint32_t kSecondsPerDay = 24UL * 3600UL;
    const uint32_t targetDay = (epoch + kUtcOffsetSec) / kSecondsPerDay;
    const uint32_t currentDay = (nowEpoch + kUtcOffsetSec) / kSecondsPerDay;
    char time[8]{};
    if (!Esp32BaseTime::formatEpoch(epoch, time, sizeof(time), "%H:%M")) return false;
    if (targetDay == currentDay) {
        std::snprintf(output, outputSize, "今天 %s", time);
        return true;
    }
    if (targetDay == currentDay + 1U) {
        std::snprintf(output, outputSize, "明天 %s", time);
        return true;
    }
    if (targetDay == currentDay + 2U) {
        std::snprintf(output, outputSize, "后天 %s", time);
        return true;
    }
    return Esp32BaseTime::formatEpoch(epoch, output, outputSize, "%m月%d日 %H:%M");
}

void formatElapsed(uint32_t seconds, char* output, std::size_t outputSize) {
    if (seconds < 60U) {
        std::snprintf(output, outputSize, "%lu 秒", static_cast<unsigned long>(seconds));
    } else if (seconds < 3600U) {
        std::snprintf(output, outputSize, "%lu 分 %lu 秒",
                      static_cast<unsigned long>(seconds / 60U),
                      static_cast<unsigned long>(seconds % 60U));
    } else {
        std::snprintf(output, outputSize, "%lu 小时 %lu 分",
                      static_cast<unsigned long>(seconds / 3600U),
                      static_cast<unsigned long>((seconds % 3600U) / 60U));
    }
}

void sendDuration(uint32_t seconds) {
    char text[32]{};
    formatElapsed(seconds, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void sendWaterVolume(uint64_t milliliters) {
    if (milliliters < 1000ULL) {
        sendUnsigned64(milliliters);
        Esp32BaseWeb::sendChunk(" mL");
        return;
    }
    const uint64_t liters = milliliters / 1000ULL;
    const uint64_t remainder = milliliters % 1000ULL;
    sendUnsigned64(liters);
    if (remainder != 0) {
        char decimals[5];
        std::snprintf(decimals, sizeof(decimals), ".%03u",
                      static_cast<unsigned>(remainder));
        std::size_t length = std::strlen(decimals);
        while (length > 1 && decimals[length - 1U] == '0') {
            decimals[--length] = '\0';
        }
        Esp32BaseWeb::sendChunk(decimals);
    }
    Esp32BaseWeb::sendChunk(" L");
}

void sendLiters(uint64_t milliliters) {
    char text[32];
    std::snprintf(text,
                  sizeof(text),
                  "%llu.%03llu L",
                  static_cast<unsigned long long>(milliliters / 1000ULL),
                  static_cast<unsigned long long>(milliliters % 1000ULL));
    Esp32BaseWeb::sendChunk(text);
}

void sendFlowRate(uint32_t millilitersPerMinute) {
    sendLiters(millilitersPerMinute);
    Esp32BaseWeb::sendChunk("/min");
}

void sendRecordTimeRange(const Esp32BaseRecordStore::RecordTiming& timing) {
    uint32_t completedEpoch = 0;
    char started[24]{};
    char completed[24]{};
    if (Esp32BaseRecordStore::resolveCompletedEpoch(timing, completedEpoch) &&
        completedEpoch >= timing.durationSec &&
        Esp32BaseTime::formatEpoch(completedEpoch - timing.durationSec,
                                   started,
                                   sizeof(started),
                                   "%m-%d %H:%M:%S") &&
        Esp32BaseTime::formatEpoch(completedEpoch,
                                   completed,
                                   sizeof(completed),
                                   "%H:%M:%S")) {
        Esp32BaseWeb::writeHtmlEscaped(started);
        Esp32BaseWeb::sendChunk(" — ");
        Esp32BaseWeb::writeHtmlEscaped(completed);
        return;
    }
    sendRecordTime(timing);
}

void sendRecordSource(const WateringRecordPayload& payload,
                      const IrrigationConfig* config) {
    Esp32BaseWeb::sendChunk(sourceName(payload.source));
    if (payload.planId == 0) return;
    Esp32BaseWeb::sendChunk(" · ");
    if (config && payload.planId <= config->plans.size()) {
        const WateringPlan& plan = config->plans[payload.planId - 1U];
        if (plan.configured) {
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            return;
        }
    }
    Esp32BaseWeb::sendChunk("计划 ");
    sendUnsigned(payload.planId);
    Esp32BaseWeb::sendChunk("（已删除）");
}

bool recordHasCappedEstimate(const WateringRecordPayload& payload) {
    for (const ZoneWateringRecord& zone : payload.zones) {
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            return true;
        }
    }
    return false;
}

uint8_t recordWateredZoneCount(const WateringRecordPayload& payload) {
    uint8_t count = 0;
    for (const ZoneWateringRecord& zone : payload.zones) {
        if (zone.actualWateringSec != 0 || zone.pulseCount != 0) ++count;
    }
    return count;
}

void sendRecordWateredZones(const WateringRecordPayload& payload,
                            const IrrigationConfig* config) {
    const uint8_t total = recordWateredZoneCount(payload);
    uint8_t emitted = 0;
    for (uint8_t index = 0; index < payload.zones.size() && emitted < 2; ++index) {
        const ZoneWateringRecord& zone = payload.zones[index];
        if (zone.actualWateringSec == 0 && zone.pulseCount == 0) continue;
        if (emitted != 0) Esp32BaseWeb::sendChunk("、");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        ++emitted;
    }
    if (total > emitted) {
        Esp32BaseWeb::sendChunk(" 等 ");
        sendUnsigned(total);
        Esp32BaseWeb::sendChunk(" 路");
    }
}

bool recordHasFlowAlert(const WateringRecordPayload& payload) {
    for (const ZoneWateringRecord& zone : payload.zones) {
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) != 0) {
            return true;
        }
    }
    return false;
}

uint8_t recordFlowAlertZoneCount(const WateringRecordPayload& payload) {
    uint8_t count = 0;
    for (const ZoneWateringRecord& zone : payload.zones) {
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) != 0) {
            ++count;
        }
    }
    return count;
}

