tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void sendRecordFlowAlertSummary(const WateringRecordPayload& payload,
                                const IrrigationConfig* config) {
    const uint8_t total = recordFlowAlertZoneCount(payload);
    if (total == 0) {
        Esp32BaseWeb::sendChunk("未发现流量异常");
        return;
    }
    if (total > 1) {
        sendUnsigned(total);
        Esp32BaseWeb::sendChunk(" 路存在流量异常");
        return;
    }
    for (uint8_t index = 0; index < payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = payload.zones[index];
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0) {
            continue;
        }
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk(
            (zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0
                ? " 高流量"
                : " 低流量");
        return;
    }
}

struct LatestRecordContext {
    bool found = false;
    StoredWateringRecord record{};
};

void collectLatestRecord(const StoredWateringRecord& record, void* user) {
    auto* context = static_cast<LatestRecordContext*>(user);
    if (context && !context->found) {
        context->record = record;
        context->found = true;
    }
}

struct RecordRowsContext {
    const IrrigationConfig* config;
    uint32_t emitted;
};

void sendRecordDetailDialog(const StoredWateringRecord& record,
                            const IrrigationConfig* config,
                            const char* dialogPrefix) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    const uint8_t wateredZoneCount = recordWateredZoneCount(record.payload);
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogPrefix);
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal record-detail-dialog' data-eb-light-dismiss='1'><div class='record-detail-head'><div><span class='muted'>");
    sendRecordSource(record.payload, config);
    Esp32BaseWeb::sendChunk("</span><h2>");
    sendRecordTime(record.timing, "%m月%d日 %H:%M");
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary record-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><div class='record-detail-result'><span class='tag ");
    Esp32BaseWeb::sendChunk(resultToneClass(record.payload.result));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(resultName(record.payload.result));
    Esp32BaseWeb::sendChunk("</span><span>结束原因：");
    Esp32BaseWeb::sendChunk(stopReasonName(record.payload.stopReason));
    Esp32BaseWeb::sendChunk("</span></div><div class='record-detail-metrics'><div><span>实际浇水时间</span><b>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</b></div><div><span>估算用水量</span><b>");
    if (recordHasCappedEstimate(record.payload)) {
        Esp32BaseWeb::sendChunk("至少 ");
    }
    sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</b></div><div><span>流量异常水路</span><b>");
    sendUnsigned(recordFlowAlertZoneCount(record.payload));
    Esp32BaseWeb::sendChunk(" 路</b></div><div><span>实际执行水路</span><b>");
    sendUnsigned(wateredZoneCount);
    Esp32BaseWeb::sendChunk(" 路</b></div></div><div class='record-detail-section'><h3>执行时间</h3><div class='record-detail-grid'><div class='record-time-range'><b>开始 — 完成</b><span>");
    sendRecordTimeRange(record.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>计划浇水</b><span>");
    sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>整次历时</b><span>");
    sendDuration(record.timing.durationSec);
    Esp32BaseWeb::sendChunk("</span></div></div></div><div class='record-detail-section'><h3>水路明细</h3><p>水路名称按当前设置显示；流量、基准和用水量均保留浇水当时的记录。</p><div class='tablewrap'><table class='record-zone-table'><thead><tr><th>水路</th><th>结果</th><th>实际 / 计划</th><th>估算用水量</th><th>流量表现</th></tr></thead><tbody>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<tr><td data-label='水路'><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b></td><td data-label='结果'>");
        Esp32BaseWeb::sendChunk(zoneResultName(zone.result));
        Esp32BaseWeb::sendChunk("</td><td data-label='实际 / 计划' class='record-duration-pair'><b>");
        sendDuration(zone.actualWateringSec);
        Esp32BaseWeb::sendChunk("</b><span>/</span><small>");
        sendDuration(zone.plannedDurationSec);
        Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("至少 ");
        }
        sendWaterVolume(zone.estimatedWaterMl);
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("<small class='warn'>达到记录上限</small>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-label='流量表现'><div class='record-flow-performance'>");
        if (zone.result == ZoneWateringResult::NotStarted) {
            Esp32BaseWeb::sendChunk("<span class='muted'>—</span>");
        } else {
            Esp32BaseWeb::sendChunk("<span>整段平均 ");
            sendFlowRate(zone.averageFlowMlPerMinute);
            Esp32BaseWeb::sendChunk("</span>");
            if ((zone.flags &
                 WateringRecordCodec::kZoneFlagTerminalFlowAvailable) != 0) {
                Esp32BaseWeb::sendChunk("<span>");
                Esp32BaseWeb::sendChunk(
                    (zone.flags &
                     WateringRecordCodec::kZoneFlagTerminalFlowStable) != 0
                        ? "末段稳定 "
                        : "末段平均 ");
                sendFlowRate(zone.terminalFlowMlPerMinute);
                if ((zone.flags &
                     WateringRecordCodec::kZoneFlagTerminalFlowStable) == 0) {
                    Esp32BaseWeb::sendChunk("（");
                    sendFlowRate(zone.terminalMinimumFlowMlPerMinute);
                    Esp32BaseWeb::sendChunk("～");
                    sendFlowRate(zone.terminalMaximumFlowMlPerMinute);
                    Esp32BaseWeb::sendChunk("，未稳定）");
                }
                Esp32BaseWeb::sendChunk("</span>");
            } else {
                Esp32BaseWeb::sendChunk("<span class='muted'>末段样本不足</span>");
            }
            if ((zone.flags &
                 WateringRecordCodec::kZoneFlagFlowBaselineAvailable) != 0) {
                Esp32BaseWeb::sendChunk("<span>当时基准 ");
                sendFlowRate(zone.baselineFlowMlPerMinute);
                Esp32BaseWeb::sendChunk("</span>");
                if ((zone.flags &
                     WateringRecordCodec::kZoneFlagTerminalFlowAvailable) != 0) {
                    char comparison[48]{};
                    formatFlowChange(zone.terminalFlowMlPerMinute,
                                     zone.baselineFlowMlPerMinute,
                                     comparison,
                                     sizeof(comparison));
                    Esp32BaseWeb::sendChunk("<span>末段相对基准 ");
                    Esp32BaseWeb::writeHtmlEscaped(comparison);
                    Esp32BaseWeb::sendChunk("</span>");
                }
            } else {
                Esp32BaseWeb::sendChunk("<span class='muted'>未设置基准</span>");
            }
        }
        Esp32BaseWeb::sendChunk("<div class='record-flags'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag warn'>低流量</span>");
        }
        if ((zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag danger'>高流量</span>");
        }
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0) {
            if ((zone.flags &
                 WateringRecordCodec::kZoneFlagFlowBaselineAvailable) != 0) {
                Esp32BaseWeb::sendChunk("<span class='tag ok'>正常</span>");
            } else {
                Esp32BaseWeb::sendChunk("<span class='muted'>未设置基准</span>");
            }
        }
        Esp32BaseWeb::sendChunk("</div></div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div></div><details class='record-technical'><summary>技术记录</summary><div class='record-technical-grid'><div><b>总脉冲</b><span>");
    sendUnsigned64(totals.pulseCount);
    Esp32BaseWeb::sendChunk("</span></div>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<div><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b><span>");
        sendUnsigned(zone.pulseCount);
        Esp32BaseWeb::sendChunk(" 脉冲</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div></details><p class='record-detail-note'>整段平均流量只统计水流建立后的有效浇水阶段；末段流量使用最后 5 个完整的 5 秒窗口判断，窗口不足或波动过大时不会描述为稳定；估算用水量包含建立水流和关阀尾水阶段的实际脉冲。</p><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>关闭</button></div></dialog>");
}

void sendRecordRow(const StoredWateringRecord& record, void* user) {
    RecordRowsContext* context = static_cast<RecordRowsContext*>(user);
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    if (context) ++context->emitted;
    Esp32BaseWeb::sendChunk("<tr><td data-label='完成时间' class='record-time'>");
    sendRecordTime(record.timing);
    Esp32BaseWeb::sendChunk("</td><td data-label='来源'>");
    sendRecordSource(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='实际水路' class='record-zones'>");
    sendRecordWateredZones(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='结果'><span class='tag ");
    Esp32BaseWeb::sendChunk(resultToneClass(record.payload.result));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(resultName(record.payload.result));
    Esp32BaseWeb::sendChunk("</span>");
    if (record.payload.result != WateringResult::Completed) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        Esp32BaseWeb::sendChunk(stopReasonName(record.payload.stopReason));
        Esp32BaseWeb::sendChunk("</small>");
    } else if (recordHasFlowAlert(record.payload)) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        sendRecordFlowAlertSummary(
            record.payload, context ? context->config : nullptr);
        Esp32BaseWeb::sendChunk("</small>");
    }
    Esp32BaseWeb::sendChunk("</td><td data-label='浇水时间' class='record-number'><span>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</span><small>计划 ");
    sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量' class='record-number'>");
    if (recordHasCappedEstimate(record.payload)) Esp32BaseWeb::sendChunk("至少 ");
    sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='record-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('record-detail-");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendRecordDetailDialog(record, context ? context->config : nullptr, "record-detail-");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void csvRecord(const StoredWateringRecord& record, void*) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    char line[192];
    std::snprintf(line,
                  sizeof(line),
                  "%lu,%lu,%s,%u,%s,%lu,%llu,%llu,%lu\r\n",
                  static_cast<unsigned long>(record.recordId),
                  static_cast<unsigned long>(record.timing.completedEpochSec),
                  sourceName(record.payload.source),
                  record.payload.planId,
                  resultName(record.payload.result),
                  static_cast<unsigned long>(record.timing.durationSec),
                  static_cast<unsigned long long>(totals.pulseCount),
                  static_cast<unsigned long long>(totals.estimatedWaterMl),
                  static_cast<unsigned long>(totals.averageFlowMlPerMinute));
    Esp32BaseWeb::sendChunk(line);
}

struct EventFilter {
    uint8_t level = 0;
    int8_t category = -1;
    char query[64]{};
};

struct EventRowsContext {
    const EventFilter* filter;
    uint32_t offset;
    uint32_t limit;
    uint32_t matched;
    uint32_t emitted;
};

const char* eventToneClass(Esp32BaseAppEvents::Level level) {
    switch (level) {
        case Esp32BaseAppEvents::Level::Warning: return "warn";
        case Esp32BaseAppEvents::Level::Error: return "danger";
        case Esp32BaseAppEvents::Level::Info:
        default: return "info";
    }
}

const char* conditionStateName(
    IrrigationEvents::ConditionDisplayState state) {
    switch (state) {
        case IrrigationEvents::ConditionDisplayState::Normal: return "正常";
        case IrrigationEvents::ConditionDisplayState::Active: return "异常中";
        case IrrigationEvents::ConditionDisplayState::ConfirmingActivation:
            return "异常确认中";
        case IrrigationEvents::ConditionDisplayState::ConfirmingRecovery:
            return "恢复确认中";
        case IrrigationEvents::ConditionDisplayState::Unknown:
        default: return "等待判断";
    }
}

