tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::activeTask() {
    if (!beginPage("首页", "查看当前任务的实时状态")) return;
    Esp32BaseWeb::sendChunk(R"HTML(<style>
.run-idle-hero{display:flex;align-items:center;justify-content:space-between;gap:16px;padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f4faf7,#fff)}.run-idle-hero h3{margin:0 0 4px;font-size:19px}.run-idle-hero p{margin:0;color:var(--eb-muted)}
.run-live-head{display:flex;align-items:center;justify-content:space-between;gap:18px;padding:12px 14px;border:1px solid #cbdde5;border-radius:10px;background:linear-gradient(135deg,var(--eb-info-soft),#fff)}.run-live-title{display:flex;align-items:center;gap:9px;min-width:0}.run-live-title h3{margin:0;font-size:18px;font-weight:600;overflow-wrap:anywhere}.run-live-title .tag{flex:0 0 auto;font-size:11px;font-weight:500}.run-live-head p{margin:3px 0 0;color:var(--eb-muted);font-size:13px}.run-live-head form{flex:0 0 auto;margin:0}.run-live-head input{min-height:36px;font-weight:500}
.run-live-metrics{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:9px;margin-top:12px}.run-live-metric{padding:12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft)}.run-live-metric span{display:block;color:var(--eb-muted);font-size:12px;font-weight:400}.run-live-metric b{display:block;margin-top:3px;font-size:18px;font-weight:500;font-variant-numeric:tabular-nums;overflow-wrap:anywhere}.run-live-metric small{display:block;margin-top:3px;color:var(--eb-muted);font-size:10px;font-weight:400;line-height:1.35}
.run-live-grid{display:grid;grid-template-columns:minmax(260px,.8fr) minmax(0,1.4fr);gap:12px;margin-top:12px}.run-current,.run-chart-card{padding:15px;border:1px solid var(--eb-line);border-radius:10px;background:#fff}.run-section-label{display:block;margin-bottom:5px;color:var(--eb-muted);font-size:12px;font-weight:400}.run-current-head{display:flex;align-items:center;justify-content:space-between;gap:10px}.run-current-head h3{margin:0;font-size:19px;font-weight:500}.run-current-head .tag{flex:0 0 auto;font-weight:500}.run-progress{height:10px;margin:13px 0 8px;border-radius:999px;background:var(--eb-line-soft);overflow:hidden}.run-progress span{display:block;height:100%;width:0;border-radius:inherit;background:var(--eb-primary);transition:width .25s ease}.run-current-detail{display:flex;justify-content:space-between;gap:10px;color:var(--eb-muted);font-size:13px;font-variant-numeric:tabular-nums}.run-flow-facts{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px;margin-top:13px}.run-flow-fact{padding:9px 10px;border-radius:8px;background:var(--eb-soft)}.run-flow-fact span{display:block;color:var(--eb-muted);font-size:11px;font-weight:400}.run-flow-fact b{display:block;margin-top:2px;font-size:14px;font-weight:500;font-variant-numeric:tabular-nums}.run-chart-card{min-width:0}.run-chart-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:8px}.run-chart-head h3{margin:0;font-size:16px;font-weight:500}.run-chart-head span{color:var(--eb-muted);font-size:12px;font-weight:400}.run-chart-wrap{position:relative;min-height:205px}.run-chart-wrap canvas{display:block;width:100%;height:205px}.run-chart-empty{position:absolute;inset:0;display:flex;align-items:center;justify-content:center;color:var(--eb-muted);font-size:13px;pointer-events:none}
.run-steps{display:grid;gap:8px;margin-top:12px}.run-step{display:grid;grid-template-columns:34px minmax(0,1fr) auto;gap:10px;align-items:center;padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:#fff}.run-step-icon{display:flex;align-items:center;justify-content:center;width:28px;height:28px;border-radius:50%;background:var(--eb-soft);color:var(--eb-muted);font-size:12px;font-weight:500}.run-step.current{border-color:#9fc8d0;background:var(--eb-primary-soft)}.run-step.current .run-step-icon{background:var(--eb-primary);color:#fff}.run-step.complete .run-step-icon{background:var(--eb-ok);color:#fff}.run-step-main b,.run-step-main small{display:block}.run-step-main b{font-weight:400}.run-step.current .run-step-main b{font-weight:500}.run-step-main small,.run-step-detail{color:var(--eb-muted);font-size:12px;font-weight:400}.run-step-detail{text-align:right}.run-note{margin:10px 0 0;color:var(--eb-muted);font-size:12px;font-weight:400}
@media(max-width:900px){.run-live-metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.run-live-grid{grid-template-columns:1fr}}
@media(max-width:760px){.run-live-head{align-items:stretch;flex-direction:column;gap:10px}.run-live-head form input{width:100%}.run-live-metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.run-live-grid{grid-template-columns:1fr}.run-step{grid-template-columns:30px minmax(0,1fr)}.run-step-detail{grid-column:2;text-align:left}}
@media(max-width:420px){.run-live-metrics,.run-flow-facts{grid-template-columns:1fr}}
</style>)HTML");
    const IrrigationConfig* config = g_app->configuration();
    const WateringStatus status = g_app->wateringStatus();
    if (status.purpose != WateringPurpose::Normal) {
        const bool calibration = status.purpose == WateringPurpose::FlowCalibration;
        Esp32BaseWeb::beginPanel("当前维护任务");
        Esp32BaseWeb::sendChunk("<div class='run-live-head'><div><span>维护任务</span><h3>");
        Esp32BaseWeb::sendChunk(calibration ? "流量计校准" : "基准流量学习");
        Esp32BaseWeb::sendChunk("</h3><p>任务正在设备上继续运行，请返回专属页面查看数据或停止。</p></div><a class='btnlink info' href='");
        if (calibration) {
            Esp32BaseWeb::sendChunk("/irrigation/zones/flow-calibration");
        } else {
            Esp32BaseWeb::sendChunk("/irrigation/zones/learning?zone=");
            sendUnsigned(status.activeZoneId);
        }
        Esp32BaseWeb::sendChunk("'>查看任务</a></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::sendChunk("<script>(function(){function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active)location.reload();else setTimeout(poll,2000)}).catch(function(){setTimeout(poll,3000)})}setTimeout(poll,2000)})();</script>");
        endPage();
        return;
    }
    if (status.active) {
        const WateringPlan* activePlan = nullptr;
        if (config && status.planId >= 1 && status.planId <= config->plans.size() &&
            config->plans[status.planId - 1U].configured) {
            activePlan = &config->plans[status.planId - 1U];
        }
        const char* taskName = "手动浇水";
        const char* taskSource = status.source == WateringSource::AutomaticPlan
                                     ? "自动计划"
                                     : "手动浇水";
        if (status.purpose == WateringPurpose::FlowCalibration) {
            taskName = "流量计校准";
            taskSource = "维护任务";
        } else if (status.purpose == WateringPurpose::ZoneFlowLearning) {
            taskName = "基准流量学习";
            taskSource = "维护任务";
        } else if (activePlan) {
            taskName = activePlan->name.data();
        }
        const char* activeZoneName = "—";
        if (config && status.activeZoneId >= 1 && status.activeZoneId <= config->zones.size()) {
            activeZoneName = config->zones[status.activeZoneId - 1U].name.data();
        }
        const uint32_t currentTargetSec = status.currentStepIndex < status.stepCount
                                              ? status.zones[status.currentStepIndex].plannedDurationSec
                                              : 0U;
        const uint32_t progress = currentTargetSec == 0
                                      ? 0U
                                      : (status.currentZoneElapsedSec >= currentTargetSec
                                             ? 100U
                                             : status.currentZoneElapsedSec * 100U / currentTargetSec);
        Esp32BaseWeb::beginPanel("当前运行");
        Esp32BaseWeb::sendChunk("<div id='run-live' data-generation='"); sendUnsigned(status.flowHistoryGeneration);
        Esp32BaseWeb::sendChunk("' data-serial='"); sendUnsigned(status.flowSampleSerial);
        Esp32BaseWeb::sendChunk("' data-expected-flow='"); sendUnsigned(status.expectedFlowMlPerMinute);
        Esp32BaseWeb::sendChunk("'><div class='run-live-head'><div><div class='run-live-title'><h3>");
        Esp32BaseWeb::writeHtmlEscaped(taskName);
        Esp32BaseWeb::sendChunk("</h3>");
        if (std::strcmp(taskSource, taskName) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag info'>");
            Esp32BaseWeb::writeHtmlEscaped(taskSource);
            Esp32BaseWeb::sendChunk("</span>");
        }
        Esp32BaseWeb::sendChunk("</div><p id='run-state'>");
        Esp32BaseWeb::writeHtmlEscaped(activeZoneName);
        Esp32BaseWeb::sendChunk(" · ");
        if (status.state == WateringState::WateringZone) {
            Esp32BaseWeb::sendChunk(status.flowEstablished ? "水流已建立" : "等待水流建立");
        } else {
            Esp32BaseWeb::writeHtmlEscaped(wateringStateName(status.state));
        }
        Esp32BaseWeb::sendChunk("</p></div><form method='post' action='/irrigation' onsubmit=\"return confirm('确认停止当前整次浇水任务？')&&once(this)\"><input type='hidden' name='action' value='stop'><input class='danger' type='submit' value='停止当前任务'></form></div>");
        Esp32BaseWeb::sendChunk("<div class='run-live-metrics'><div class='run-live-metric'><span>任务总历时</span><b id='run-elapsed'>"); sendDuration(status.elapsedSec);
        Esp32BaseWeb::sendChunk("</b><small>含设备准备、等待水流和水路切换</small></div><div class='run-live-metric'><span>预计剩余浇水</span><b id='run-remaining'>"); sendDuration(status.plannedRemainingSec);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-live-metric'><span>累计估算水量</span><b id='run-water'>"); sendLiters(status.totalEstimatedWaterMl);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-live-metric'><span>执行进度</span><b id='run-step-count'>第 "); sendUnsigned(status.currentStepIndex + 1U); Esp32BaseWeb::sendChunk(" / "); sendUnsigned(status.stepCount);
        Esp32BaseWeb::sendChunk(" 条水路</b></div></div><div class='run-live-grid'><div class='run-current'><span class='run-section-label'>当前水路</span><div class='run-current-head'><h3 id='run-current-zone'>"); Esp32BaseWeb::writeHtmlEscaped(activeZoneName);
        const ZoneWateringSummary* currentZone =
            status.currentStepIndex < status.stepCount
                ? &status.zones[status.currentStepIndex]
                : nullptr;
        const char* flowStateTone = "warn";
        const char* flowStateText = "等待水流";
        if (status.flowEstablished && status.expectedFlowMlPerMinute == 0) {
            flowStateTone = "info";
            flowStateText = "水流已建立";
        } else if (status.flowEstablished && currentZone && currentZone->lowFlowActive) {
            flowStateTone = "warn";
            flowStateText = "低流量";
        } else if (status.flowEstablished && currentZone && currentZone->highFlowActive) {
            flowStateTone = "danger";
            flowStateText = "高流量";
        } else if (status.flowEstablished) {
            flowStateTone = "ok";
            flowStateText = "流量正常";
        }
        Esp32BaseWeb::sendChunk("</h3><span id='run-flow-state' class='tag ");
        Esp32BaseWeb::sendChunk(flowStateTone);
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(flowStateText);
        Esp32BaseWeb::sendChunk("</span></div><div class='run-progress'><span id='run-current-progress' style='width:"); sendUnsigned(progress);
        Esp32BaseWeb::sendChunk("%'></span></div><div class='run-current-detail'><span id='run-current-elapsed'>有效浇水 "); sendDuration(status.currentZoneElapsedSec);
        Esp32BaseWeb::sendChunk(" / "); sendDuration(currentTargetSec);
        Esp32BaseWeb::sendChunk("</span><span id='run-current-remaining'>剩余 "); sendDuration(status.currentZoneRemainingSec);
        Esp32BaseWeb::sendChunk("</span></div><div class='run-flow-facts'><div class='run-flow-fact'><span>当前流量</span><b id='run-flow'>");
        char flowText[20]{}; IrrigationConfigRules::formatLitersPerMinute(status.currentFlowMlPerMinute, flowText, sizeof(flowText)); Esp32BaseWeb::writeHtmlEscaped(flowText);
        Esp32BaseWeb::sendChunk(" L/min</b></div><div class='run-flow-fact'><span>基准流量</span><b id='run-expected-flow'>");
        if (status.expectedFlowMlPerMinute == 0) Esp32BaseWeb::sendChunk("未设置");
        else { char expected[20]{}; IrrigationConfigRules::formatLitersPerMinute(status.expectedFlowMlPerMinute, expected, sizeof(expected)); Esp32BaseWeb::writeHtmlEscaped(expected); Esp32BaseWeb::sendChunk(" L/min"); }
        Esp32BaseWeb::sendChunk("</b></div><div class='run-flow-fact'><span>当前水路脉冲</span><b id='run-pulses'>"); sendUnsigned(status.pulseCount);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-flow-fact'><span>当前水路估算水量</span><b id='run-zone-water'>");
        if (status.currentStepIndex < status.stepCount) sendLiters(status.zones[status.currentStepIndex].estimatedWaterMl); else Esp32BaseWeb::sendChunk("0.000 L");
        Esp32BaseWeb::sendChunk("</b></div></div></div><div class='run-chart-card'><div class='run-chart-head'><div><span class='run-section-label'>当前水路</span><h3>实时流量趋势（L/min）</h3></div><span id='run-chart-range'>正在等待数据 · 5 秒/点</span></div><div class='run-chart-wrap'><canvas id='run-flow-chart' height='205'></canvas><div id='run-chart-empty' class='run-chart-empty'>正在等待流量数据</div></div></div></div><div class='run-steps'>");
        for (uint8_t index = 0; index < status.stepCount; ++index) {
            const ZoneWateringSummary& zone = status.zones[index];
            const char* stepClass = index < status.currentStepIndex ? " complete" : (index == status.currentStepIndex ? " current" : "");
            Esp32BaseWeb::sendChunk("<div class='run-step"); Esp32BaseWeb::sendChunk(stepClass); Esp32BaseWeb::sendChunk("' data-step-index='"); sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' data-zone-id='"); sendUnsigned(zone.zoneId); Esp32BaseWeb::sendChunk("'><span class='run-step-icon'>");
            if (index < status.currentStepIndex) Esp32BaseWeb::sendChunk("&#10003;"); else sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("</span><div class='run-step-main'><b class='run-step-name'>");
            if (config && zone.zoneId >= 1 && zone.zoneId <= config->zones.size()) Esp32BaseWeb::writeHtmlEscaped(config->zones[zone.zoneId - 1U].name.data()); else { Esp32BaseWeb::sendChunk("水路 "); sendUnsigned(zone.zoneId); }
            Esp32BaseWeb::sendChunk("</b><small>计划 "); sendDuration(zone.plannedDurationSec); Esp32BaseWeb::sendChunk("</small></div><span class='run-step-detail'>");
            if (index < status.currentStepIndex) { Esp32BaseWeb::sendChunk("实际 "); sendDuration(zone.actualWateringSec); Esp32BaseWeb::sendChunk(" · "); sendLiters(zone.estimatedWaterMl); }
            else if (index == status.currentStepIndex) { Esp32BaseWeb::sendChunk("正在执行 · 剩余 "); sendDuration(status.currentZoneRemainingSec); }
            else Esp32BaseWeb::sendChunk("等待执行");
            Esp32BaseWeb::sendChunk("</span></div>");
        }
        Esp32BaseWeb::sendChunk("</div><p class='run-note'>预计剩余时间只计算计划浇水时长，不包含等待水流和设备启停延时。</p></div>");
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::sendChunk(R"HTML(<script>(function(){var live=document.getElementById('run-live'),initialActive=!!live;function duration(v){v=Math.max(0,Number(v)||0);if(v<60)return v+' 秒';if(v<3600)return Math.floor(v/60)+' 分 '+(v%60)+' 秒';return Math.floor(v/3600)+' 小时 '+Math.floor((v%3600)/60)+' 分'}function liters(v){return((Number(v)||0)/1000).toFixed(3)+' L'}function flow(v){return((Number(v)||0)/1000).toFixed(3)+' L/min'}function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}var inputs=document.querySelectorAll('.run-custom-duration'),submit=document.getElementById('run-custom-submit');function updateCustom(){var count=0,total=0;inputs.forEach(function(i){var v=Math.max(0,Math.min(120,Number(i.value)||0));if(v>0){count++;total+=v}});set('run-custom-summary',count?('已选择 '+count+' 条水路 · 合计 '+total+' 分钟'):'尚未选择水路');if(submit)submit.disabled=count===0}inputs.forEach(function(i){i.addEventListener('input',updateCustom)});window.runCustomSubmit=function(form){updateCustom();if(!submit||submit.disabled){alert('请至少为一条水路设置大于 0 的时长。');return false}return confirm('确认按当前自定义时长立即开始浇水？')&&once(form)};updateCustom();if(!initialActive){function idlePoll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(s.active)location.reload();else setTimeout(idlePoll,5000)}).catch(function(){setTimeout(idlePoll,10000)})}setTimeout(idlePoll,5000);return}var canvas=document.getElementById('run-flow-chart'),empty=document.getElementById('run-chart-empty'),samples=[],generation=Number(live.dataset.generation||0),serial=Number(live.dataset.serial||0),expectedFlow=Number(live.dataset.expectedFlow||0);
function rangeDuration(value){if(value<60)return value+' 秒';if(value%60===0)return value/60+' 分钟';return Math.floor(value/60)+' 分 '+value%60+' 秒'}
function draw(){
if(!canvas)return;
var rect=canvas.getBoundingClientRect(),dpr=window.devicePixelRatio||1,w=Math.max(280,rect.width),h=205,left=52,right=12,top=14,bottom=28,plotW=w-left-right,plotH=h-top-bottom;
canvas.width=w*dpr;canvas.height=h*dpr;
var c=canvas.getContext('2d');c.scale(dpr,dpr);c.clearRect(0,0,w,h);c.font='11px sans-serif';c.fillStyle='#667085';c.textBaseline='middle';
var count=samples.length,coverage=Math.min(600,count*5);
set('run-chart-range',count?('最近 '+rangeDuration(coverage)+' · 5 秒/点'):'正在等待数据 · 5 秒/点');
var maximum=count?Math.max.apply(null,samples)/1000:1;if(expectedFlow>0)maximum=Math.max(maximum,expectedFlow/1000);var rough=Math.max(maximum*1.08,1)/4,power=Math.pow(10,Math.floor(Math.log(rough)/Math.LN10)),normalized=rough/power,steps=[1,2,2.5,5,10],step=steps[steps.length-1]*power;
for(var s=0;s<steps.length;s++){if(normalized<=steps[s]){step=steps[s]*power;break}}
var scale=step*4;
function yText(value){if(value===0)return '0';if(value>=10)return String(Math.round(value));return value.toFixed(value>=1?1:2)}
for(var yi=0;yi<=4;yi++){var value=step*yi,y=top+plotH*(1-yi/4);c.strokeStyle=yi===0?'#cbd7dd':'#e7edef';c.lineWidth=1;c.beginPath();c.moveTo(left,y);c.lineTo(w-right,y);c.stroke();c.fillStyle='#667085';c.textAlign='right';c.fillText(yText(value),left-8,y)}
if(count){var maximumLabels=w<500?5:6,minimumStep=coverage/Math.max(1,maximumLabels-1),timeSteps=[5,10,15,30,60,120],timeStep=timeSteps[timeSteps.length-1];for(var ts=0;ts<timeSteps.length;ts++){if(timeSteps[ts]>=minimumStep){timeStep=timeSteps[ts];break}}var ticks=[coverage],next=Math.floor((coverage-1)/timeStep)*timeStep;while(next>0){ticks.push(next);next-=timeStep}ticks.push(0);ticks.forEach(function(ago){var x=left+plotW*(1-ago/coverage);c.strokeStyle='#eef2f4';c.beginPath();c.moveTo(x,top);c.lineTo(x,top+plotH);c.stroke();var label=ago===0?'现在':rangeDuration(ago)+'前';c.fillStyle='#667085';c.textBaseline='bottom';c.textAlign=ago===coverage?'left':(ago===0?'right':'center');c.fillText(label,x,h-2)})}
if(count===0){if(empty)empty.style.display='flex';return}
if(empty)empty.style.display='none';
if(expectedFlow>0){var baseline=expectedFlow/1000,baselineY=top+plotH*(1-baseline/scale);c.save();c.setLineDash([5,4]);c.strokeStyle='#7b8d94';c.lineWidth=1;c.beginPath();c.moveTo(left,baselineY);c.lineTo(w-right,baselineY);c.stroke();c.restore();c.fillStyle='#667085';c.textAlign='right';c.textBaseline='bottom';c.fillText('基准 '+baseline.toFixed(3),w-right-4,baselineY-3)}
c.strokeStyle='#117b8b';c.lineWidth=2;c.lineJoin='round';c.lineCap='round';c.beginPath();
samples.forEach(function(value,index){var x=left+plotW*((index+1)/count),y=top+plotH*(1-(value/1000)/scale);if(index===0)c.moveTo(x,y);else c.lineTo(x,y)});
c.stroke();
var latest=samples[count-1]/1000,latestX=w-right,latestY=top+plotH*(1-latest/scale);c.fillStyle='#117b8b';c.beginPath();c.arc(latestX,latestY,3.5,0,Math.PI*2);c.fill()
}
function loadHistory(){fetch('/irrigation/api/flow-history',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(h){samples=Array.isArray(h.samples)?h.samples.slice(-120):[];generation=Number(h.generation||0);serial=Number(h.latestSerial||0);draw()}).catch(function(){setTimeout(loadHistory,2000)})}function update(s){set('run-elapsed',duration(s.elapsedSec));set('run-remaining',duration(s.plannedRemainingSec));set('run-water',liters(s.totalEstimatedWaterMl));set('run-step-count','第 '+(Number(s.currentStepIndex)+1)+' / '+s.stepCount+' 条水路');set('run-current-elapsed','有效浇水 '+duration(s.currentZoneElapsedSec)+' / '+duration((s.zones[s.currentStepIndex]||{}).plannedDurationSec));set('run-current-remaining','剩余 '+duration(s.currentZoneRemainingSec));set('run-flow',flow(s.currentFlowMlPerMinute));expectedFlow=Number(s.expectedFlowMlPerMinute||0);set('run-expected-flow',expectedFlow?flow(expectedFlow):'未设置');set('run-pulses',s.pulseCount);var activeZone=s.zones[s.currentStepIndex]||{};set('run-zone-water',liters(activeZone.estimatedWaterMl));var current=document.querySelector('[data-step-index=\"'+s.currentStepIndex+'\"]'),zoneName='水路 '+s.zoneId;if(current){var name=current.querySelector('.run-step-name');if(name)zoneName=name.textContent;set('run-current-zone',zoneName)}var states=['空闲','区域启动中','等待水流','正在浇水','区域停止中'],phase=Number(s.state)===3?(s.flowEstablished?'水流已建立':'等待水流建立'):(states[s.state]||'未知');set('run-state',zoneName+' · '+phase);var target=Number(activeZone.plannedDurationSec)||0,percent=target?Math.min(100,Math.round(Number(s.currentZoneElapsedSec)*100/target)):0,bar=document.getElementById('run-current-progress');if(bar)bar.style.width=percent+'%';var flowState=document.getElementById('run-flow-state');if(flowState){var flowTone='warn',flowLabel='等待水流';if(s.flowEstablished&&!expectedFlow){flowTone='info';flowLabel='水流已建立'}else if(s.flowEstablished&&activeZone.lowFlowActive){flowTone='warn';flowLabel='低流量'}else if(s.flowEstablished&&activeZone.highFlowActive){flowTone='danger';flowLabel='高流量'}else if(s.flowEstablished){flowTone='ok';flowLabel='流量正常'}flowState.textContent=flowLabel;flowState.className='tag '+flowTone}document.querySelectorAll('.run-step').forEach(function(row){var i=Number(row.dataset.stepIndex),z=s.zones[i]||{},icon=row.querySelector('.run-step-icon'),detail=row.querySelector('.run-step-detail');row.classList.toggle('complete',i<s.currentStepIndex);row.classList.toggle('current',i===s.currentStepIndex);if(icon)icon.textContent=i<s.currentStepIndex?'✓':String(i+1);if(detail){if(i<s.currentStepIndex)detail.textContent='实际 '+duration(z.actualWateringSec)+' · '+liters(z.estimatedWaterMl);else if(i===s.currentStepIndex)detail.textContent='正在执行 · 剩余 '+duration(s.currentZoneRemainingSec);else detail.textContent='等待执行'}});var nextGeneration=Number(s.flowHistoryGeneration||0),nextSerial=Number(s.flowSampleSerial||0);if(nextGeneration!==generation){generation=nextGeneration;loadHistory()}else if(nextSerial!==serial){if(nextSerial===serial+1){samples.push(Number(s.currentFlowMlPerMinute)||0);if(samples.length>120)samples.shift();serial=nextSerial;draw()}else loadHistory()}}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active){location.reload();return}update(s);setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}window.addEventListener('resize',draw);loadHistory();setTimeout(poll,1000)})();</script>)HTML");
    endPage();
}

