tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    EventFilter filter{};
    char value[20]{};
    if (getParam("level", value, sizeof(value))) {
        if (std::strcmp(value, "info") == 0) filter.level = static_cast<uint8_t>(Esp32BaseAppEvents::Level::Info);
        else if (std::strcmp(value, "warning") == 0) filter.level = static_cast<uint8_t>(Esp32BaseAppEvents::Level::Warning);
        else if (std::strcmp(value, "error") == 0) filter.level = static_cast<uint8_t>(Esp32BaseAppEvents::Level::Error);
    }
    if (getParam("category", value, sizeof(value))) {
        if (std::strcmp(value, "watering") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::WateringAndFlow);
        else if (std::strcmp(value, "automatic") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::AutomaticWatering);
        else if (std::strcmp(value, "settings") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::SettingsAndCalibration);
        else if (std::strcmp(value, "time") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::TimeAndStorage);
    }
    const char* levelQuery = filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Info) ? "info" :
                             filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Warning) ? "warning" :
                             filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Error) ? "error" : "";
    const char* categoryQuery = filter.category == static_cast<int8_t>(IrrigationEvents::Category::WateringAndFlow) ? "watering" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::AutomaticWatering) ? "automatic" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::SettingsAndCalibration) ? "settings" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::TimeAndStorage) ? "time" : "";
    if (levelQuery[0] && categoryQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "level=%s&category=%s", levelQuery, categoryQuery);
    else if (levelQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "level=%s", levelQuery);
    else if (categoryQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "category=%s", categoryQuery);

    uint32_t page = 1;
    if (getParam("page", value, sizeof(value))) parseUint(value, 1, UINT32_MAX, page);
    Esp32BaseAppEvents::AppEventsStatus status{};
    const bool statusReady = g_app->readEventStatus(status) && status.eventStore.ready;
    if (!statusReady) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "事件暂时无法读取",
                                 "请在系统状态中检查事件存储。");
        endPage();
        return;
    }
    if (!status.conditionStateLoaded || status.conditionStateSavePending) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "事件状态保存异常",
                                 "持续问题仍会显示当前状态，但新的发生或恢复可能无法保存。");
    }

    struct ConditionCard {
        uint8_t id;
        const char* name;
        const char* description;
    };
    static constexpr ConditionCard conditions[] = {
        {1, "硬件时钟", "影响断网后的可靠计时"},
        {2, "设备时间", "影响自动计划按时执行"},
        {3, "时间倒退保护", "异常时暂停自动计划"},
        {4, "关阀后水流", "监测阀门关闭后的异常水流"},
    };
    IrrigationEvents::ConditionDisplayState conditionStates[
        sizeof(conditions) / sizeof(conditions[0])]{};
    uint8_t activeConditionCount = 0;
    for (std::size_t index = 0;
         index < sizeof(conditions) / sizeof(conditions[0]);
         ++index) {
        conditionStates[index] =
            g_app->eventConditionState(conditions[index].id);
        if (conditionStates[index] ==
                IrrigationEvents::ConditionDisplayState::Active ||
            conditionStates[index] ==
                IrrigationEvents::ConditionDisplayState::ConfirmingRecovery) {
            ++activeConditionCount;
        }
    }
    Esp32BaseWeb::beginPanel("当前持续状态");
    Esp32BaseWeb::sendChunk("<div class='condition-summary'><p>共监测 4 项；当前持续异常 ");
    sendUnsigned(activeConditionCount);
    Esp32BaseWeb::sendChunk(" 项</p><small>等待判断不计入异常；需要确认的状态会明确标出</small></div><div class='condition-grid'>");
    for (std::size_t index = 0;
         index < sizeof(conditions) / sizeof(conditions[0]);
         ++index) {
        const ConditionCard& condition = conditions[index];
        const IrrigationEvents::ConditionDisplayState state =
            conditionStates[index];
        Esp32BaseWeb::sendChunk("<div class='condition-item'><div><b>");
        Esp32BaseWeb::sendChunk(condition.name);
        Esp32BaseWeb::sendChunk("</b><small>");
        if (condition.id != 4) {
            Esp32BaseWeb::sendChunk(condition.description);
        } else if (g_app->wateringStatus().active) {
            Esp32BaseWeb::sendChunk("浇水期间暂停，结束后重新观察");
        } else if (g_app->unexpectedFlowObservationReady()) {
            Esp32BaseWeb::sendChunk("最近完整窗口已完成判断");
        } else if (g_app->unexpectedFlowDelayRemainingSec() != 0) {
            Esp32BaseWeb::sendChunk("等待余流消退，约剩 ");
            sendUnsigned(g_app->unexpectedFlowDelayRemainingSec());
            Esp32BaseWeb::sendChunk(" 秒");
        } else {
            Esp32BaseWeb::sendChunk("正在收集首个完整窗口，约剩 ");
            sendUnsigned(g_app->unexpectedFlowWindowRemainingSec());
            Esp32BaseWeb::sendChunk(" 秒");
        }
        Esp32BaseWeb::sendChunk("</small></div><span class='tag ");
        Esp32BaseWeb::sendChunk(conditionStateTone(state));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(conditionStateName(state));
        Esp32BaseWeb::sendChunk("</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("事件记录");
    Esp32BaseWeb::sendChunk("<form class='event-filter' method='get' action='/irrigation/events'><label>等级<select name='level'><option value=''>全部等级</option><option value='info'");
    if (filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Info)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">信息</option><option value='warning'");
    if (filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Warning)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">警告</option><option value='error'");
    if (filter.level == static_cast<uint8_t>(Esp32BaseAppEvents::Level::Error)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">错误</option></select></label><label>分类<select name='category'><option value=''>全部分类</option><option value='watering'");
    if (filter.category == static_cast<int8_t>(IrrigationEvents::Category::WateringAndFlow)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">浇水与流量</option><option value='automatic'");
    if (filter.category == static_cast<int8_t>(IrrigationEvents::Category::AutomaticWatering)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">自动计划</option><option value='settings'");
    if (filter.category == static_cast<int8_t>(IrrigationEvents::Category::SettingsAndCalibration)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">设置与校准</option><option value='time'");
    if (filter.category == static_cast<int8_t>(IrrigationEvents::Category::TimeAndStorage)) Esp32BaseWeb::sendChunk(" selected");
    Esp32BaseWeb::sendChunk(">时间与存储</option></select></label><span class='event-filter-actions'><input type='submit' value='筛选'><a class='btnlink secondary' href='/irrigation/events'>重置</a></span></form><div class='tablewrap'><table class='event-table'><thead><tr><th>时间</th><th>等级</th><th>分类</th><th>事件</th><th>说明</th><th>操作</th></tr></thead><tbody>");

