tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    EventRowsContext context{&filter, (page - 1U) * 20U, 20U, 0, 0};
    const bool readOk = status.eventStore.recordCount == 0 ||
                        g_app->readLatestEvents(0,
                                                status.eventStore.recordCount,
                                                sendEventRow,
                                                &context);
    if (readOk && context.emitted == 0) {
        Esp32BaseWeb::sendChunk("<tr><td class='event-empty' colspan='6'>");
        Esp32BaseWeb::sendChunk(status.eventStore.recordCount == 0
                                    ? "还没有事件记录。"
                                    : "当前筛选条件下没有事件。"
                               );
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    if (!readOk) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "本页事件读取失败",
                                 "请刷新页面；如果问题持续，请检查事件存储状态。");
    } else if (context.matched != 0) {
        Esp32BaseWeb::Pagination pagination{};
        pagination.path = "/irrigation/events";
        pagination.query = filter.query;
        pagination.page = page;
        pagination.perPage = 20;
        pagination.total = context.matched;
        Esp32BaseWeb::sendPagination(pagination);
    }
    Esp32BaseWeb::endPanel();
    endPage();
}

void IrrigationWeb::settings() {
    if (!Esp32BaseWeb::checkAuth()) return;
    Esp32BaseWeb::redirectSeeOther("/esp32base/app-config");
}

void IrrigationWeb::statusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const WateringStatus status = g_app->wateringStatus();
    if (!Esp32BaseWeb::beginResponse(200, "application/json")) return;
    Esp32BaseWeb::sendChunk("{\"ready\":"); Esp32BaseWeb::sendChunk(g_app->businessReady() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"active\":"); Esp32BaseWeb::sendChunk(status.active ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"state\":"); sendUnsigned(static_cast<uint32_t>(status.state));
    Esp32BaseWeb::sendChunk(",\"source\":"); sendUnsigned(static_cast<uint32_t>(status.source));
    Esp32BaseWeb::sendChunk(",\"planId\":"); sendUnsigned(status.planId);
    Esp32BaseWeb::sendChunk(",\"stepCount\":"); sendUnsigned(status.stepCount);
    Esp32BaseWeb::sendChunk(",\"currentStepIndex\":"); sendUnsigned(status.currentStepIndex);
    Esp32BaseWeb::sendChunk(",\"zoneId\":"); sendUnsigned(status.activeZoneId);
    Esp32BaseWeb::sendChunk(",\"lastZoneId\":"); sendUnsigned(status.lastZoneId);
    Esp32BaseWeb::sendChunk(",\"flowEstablished\":"); Esp32BaseWeb::sendChunk(status.flowEstablished ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"purpose\":"); sendUnsigned(static_cast<uint32_t>(status.purpose));
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":"); sendUnsigned(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"currentZoneElapsedSec\":"); sendUnsigned(status.currentZoneElapsedSec);
    Esp32BaseWeb::sendChunk(",\"currentZoneRemainingSec\":"); sendUnsigned(status.currentZoneRemainingSec);
    Esp32BaseWeb::sendChunk(",\"plannedRemainingSec\":"); sendUnsigned(status.plannedRemainingSec);
    Esp32BaseWeb::sendChunk(",\"pulseCount\":"); sendUnsigned(status.pulseCount);
    Esp32BaseWeb::sendChunk(",\"currentFlowMlPerMinute\":"); sendUnsigned(status.currentFlowMlPerMinute);
    Esp32BaseWeb::sendChunk(",\"expectedFlowMlPerMinute\":"); sendUnsigned(status.expectedFlowMlPerMinute);
    Esp32BaseWeb::sendChunk(",\"totalEstimatedWaterMl\":"); sendUnsigned64(status.totalEstimatedWaterMl);
    Esp32BaseWeb::sendChunk(",\"flowHistoryGeneration\":"); sendUnsigned(status.flowHistoryGeneration);
    Esp32BaseWeb::sendChunk(",\"flowSampleSerial\":"); sendUnsigned(status.flowSampleSerial);
    Esp32BaseWeb::sendChunk(",\"learningAverageMlPerMinute\":"); sendUnsigned(status.learningAverageMlPerMinute);
    Esp32BaseWeb::sendChunk(",\"learningMinimumMlPerMinute\":"); sendUnsigned(status.learningMinimumMlPerMinute);
    Esp32BaseWeb::sendChunk(",\"learningMaximumMlPerMinute\":"); sendUnsigned(status.learningMaximumMlPerMinute);
    Esp32BaseWeb::sendChunk(",\"learningAveragePulseRateX100\":"); sendUnsigned(status.learningAveragePulseRateX100);
    Esp32BaseWeb::sendChunk(",\"learningMinimumPulseRateX100\":"); sendUnsigned(status.learningMinimumPulseRateX100);
    Esp32BaseWeb::sendChunk(",\"learningMaximumPulseRateX100\":"); sendUnsigned(status.learningMaximumPulseRateX100);
    Esp32BaseWeb::sendChunk(",\"learningAllowedPulseRateSpreadX100\":"); sendUnsigned(status.learningAllowedPulseRateSpreadX100);
    Esp32BaseWeb::sendChunk(",\"learningWindowCount\":"); sendUnsigned(status.learningWindowCount);
    Esp32BaseWeb::sendChunk(",\"learningTotalWindowCount\":"); sendUnsigned(status.learningTotalWindowCount);
    Esp32BaseWeb::sendChunk(",\"learningWindows\":[");
    for (uint8_t index = 0; index < status.learningWindowCount; ++index) {
        if (index != 0) Esp32BaseWeb::sendChunk(",");
        const WateringStatus::LearningWindowSample& window =
            status.learningWindows[index];
        Esp32BaseWeb::sendChunk("{\"sequence\":"); sendUnsigned(window.sequence);
        Esp32BaseWeb::sendChunk(",\"pulseCount\":"); sendUnsigned(window.pulseCount);
        Esp32BaseWeb::sendChunk(",\"windowMs\":"); sendUnsigned(window.windowMs);
        Esp32BaseWeb::sendChunk(",\"pulseRateX100\":"); sendUnsigned(window.pulseRateX100);
        Esp32BaseWeb::sendChunk(",\"flowMlPerMinute\":"); sendUnsigned(window.flowMlPerMinute);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("]");
    Esp32BaseWeb::sendChunk(",\"automaticMode\":"); sendUnsigned(static_cast<uint32_t>(g_app->automaticWateringState().mode));
    const IrrigationEvents::ConditionDisplayState rtcCondition =
        g_app->eventConditionState(1);
    const bool rtcUnavailable =
        rtcCondition == IrrigationEvents::ConditionDisplayState::Active ||
        rtcCondition == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery;
    Esp32BaseWeb::sendChunk(",\"rtcUnavailable\":"); Esp32BaseWeb::sendChunk(rtcUnavailable ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowAlarm\":"); Esp32BaseWeb::sendChunk(g_app->unexpectedFlowAlarm() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowObservationReady\":"); Esp32BaseWeb::sendChunk(g_app->unexpectedFlowObservationReady() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowPulseCount\":"); sendUnsigned(g_app->unexpectedFlowObservedPulseCount());
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowDelayRemainingSec\":"); sendUnsigned(g_app->unexpectedFlowDelayRemainingSec());
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowWindowRemainingSec\":"); sendUnsigned(g_app->unexpectedFlowWindowRemainingSec());
    const IrrigationConfig* statusConfig = g_app->configuration();
    Esp32BaseWeb::sendChunk(",\"unexpectedFlowWindowSec\":");
    sendUnsigned(statusConfig ? statusConfig->flowProtection.unexpectedFlowWindowSec : 0);
    Esp32BaseWeb::sendChunk(",\"recordStorageFault\":"); Esp32BaseWeb::sendChunk(g_app->recordStorageFault() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"eventStorageFault\":"); Esp32BaseWeb::sendChunk(g_app->eventStorageFault() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"schedulerStorageFault\":"); Esp32BaseWeb::sendChunk(g_app->schedulerStorageFault() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"checkpointStorageFault\":"); Esp32BaseWeb::sendChunk(g_app->checkpointStorageFault() ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"zones\":[");
    for (uint8_t index = 0; index < status.stepCount; ++index) {
        if (index != 0) Esp32BaseWeb::sendChunk(",");
        const ZoneWateringSummary& zone = status.zones[index];
        Esp32BaseWeb::sendChunk("{\"zoneId\":"); sendUnsigned(zone.zoneId);
        Esp32BaseWeb::sendChunk(",\"result\":"); sendUnsigned(static_cast<uint32_t>(zone.result));
        Esp32BaseWeb::sendChunk(",\"plannedDurationSec\":"); sendUnsigned(zone.plannedDurationSec);
        Esp32BaseWeb::sendChunk(",\"actualWateringSec\":"); sendUnsigned(zone.actualWateringSec);
        Esp32BaseWeb::sendChunk(",\"pulseCount\":"); sendUnsigned(zone.pulseCount);
        Esp32BaseWeb::sendChunk(",\"estimatedWaterMl\":"); sendUnsigned(zone.estimatedWaterMl);
        Esp32BaseWeb::sendChunk(",\"lowFlowDetected\":"); Esp32BaseWeb::sendChunk(zone.lowFlowDetected ? "true" : "false");
        Esp32BaseWeb::sendChunk(",\"highFlowDetected\":"); Esp32BaseWeb::sendChunk(zone.highFlowDetected ? "true" : "false");
        Esp32BaseWeb::sendChunk(",\"lowFlowActive\":"); Esp32BaseWeb::sendChunk(zone.lowFlowActive ? "true" : "false");
        Esp32BaseWeb::sendChunk(",\"highFlowActive\":"); Esp32BaseWeb::sendChunk(zone.highFlowActive ? "true" : "false");
        Esp32BaseWeb::sendChunk(",\"calibrationFlowEstablishedMs\":"); sendUnsigned(zone.calibrationFlowEstablishedMs);
        Esp32BaseWeb::sendChunk(",\"calibrationSteadyStartedMs\":"); sendUnsigned(zone.calibrationSteadyStartedMs);
        Esp32BaseWeb::sendChunk(",\"calibrationStartupPulses\":"); sendUnsigned(zone.calibrationStartupPulses);
        Esp32BaseWeb::sendChunk(",\"calibrationSteadyDurationMs\":"); sendUnsigned(zone.calibrationSteadyDurationMs);
        Esp32BaseWeb::sendChunk(",\"calibrationSteadyPulses\":"); sendUnsigned(zone.calibrationSteadyPulses);
        Esp32BaseWeb::sendChunk(",\"calibrationStopDurationMs\":"); sendUnsigned(zone.calibrationStopDurationMs);
        Esp32BaseWeb::sendChunk(",\"calibrationStopPulses\":"); sendUnsigned(zone.calibrationStopPulses);
        Esp32BaseWeb::sendChunk(",\"calibrationPulseRateX100\":"); sendUnsigned(zone.calibrationPulseRateX100);
        Esp32BaseWeb::sendChunk(",\"calibrationLatestPulseRateX100\":"); sendUnsigned(zone.calibrationLatestPulseRateX100);
        Esp32BaseWeb::sendChunk(",\"calibrationWindowSec\":"); sendUnsigned(zone.calibrationWindowSec);
        Esp32BaseWeb::sendChunk(",\"calibrationRequiredWindows\":"); sendUnsigned(zone.calibrationRequiredWindows);
        Esp32BaseWeb::sendChunk(",\"calibrationAllowedVariationPercent\":"); sendUnsigned(zone.calibrationAllowedVariationPercent);
        Esp32BaseWeb::sendChunk(",\"calibrationCollectedWindows\":"); sendUnsigned(zone.calibrationCollectedWindows);
        Esp32BaseWeb::sendChunk(",\"calibrationSteadyDetected\":"); Esp32BaseWeb::sendChunk(zone.calibrationSteadyDetected ? "true" : "false");
        Esp32BaseWeb::sendChunk(",\"calibrationSteadyLaterUnstable\":"); Esp32BaseWeb::sendChunk(zone.calibrationSteadyLaterUnstable ? "true" : "false");
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endResponse();
}

void IrrigationWeb::flowHistoryApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const FlowHistorySnapshot history = g_app->wateringFlowHistory();
    if (!Esp32BaseWeb::beginResponse(200, "application/json")) return;
    Esp32BaseWeb::sendChunk("{\"zoneId\":"); sendUnsigned(history.zoneId);
    Esp32BaseWeb::sendChunk(",\"sampleIntervalSec\":5,\"generation\":"); sendUnsigned(history.generation);
    Esp32BaseWeb::sendChunk(",\"latestSerial\":"); sendUnsigned(history.latestSerial);
    Esp32BaseWeb::sendChunk(",\"samples\":[");
    for (uint16_t index = 0; index < history.sampleCount; ++index) {
        if (index != 0) Esp32BaseWeb::sendChunk(",");
        sendUnsigned(history.samples[index]);
    }
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endResponse();
}

void IrrigationWeb::recordsCsv() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (g_app->wateringStatus().active) {
        Esp32BaseWeb::sendText(409, "watering_active");
        return;
    }
    Esp32BaseRecordStore::StoreStatus status{};
    if (!g_app->readWateringRecordStoreStatus(status) ||
        !Esp32BaseWeb::beginCsv(200, "watering-records.csv")) {
        Esp32BaseWeb::sendText(500, "record_store_unavailable");
        return;
    }
    Esp32BaseWeb::sendChunk("record_id,completed_epoch,source,plan_id,result,duration_sec,total_pulses,estimated_water_ml,average_flow_ml_per_minute\r\n");
    for (uint32_t offset = 0; offset < status.recordCount; offset += 50U) {
        if (!g_app->readLatestWateringRecords(offset, 50, csvRecord, nullptr)) break;
    }
    Esp32BaseWeb::endResponse();
}
